app/Controllers/Student.php

SELECT COUNT(*) AS `numrows`
FROM `enrolments`
JOIN `students` ON `students`.`student_id` = `enrolments`.`student_id`
WHERE `students`.`user_id` = '15'
---
    private function setEnrolmentStatus()
    {
        $db = \Config\Database::connect();

        $hasEnrolment = $db->table('enrolments')
            ->join('students', 'students.student_id = enrolments.student_id')
            ->where('students.user_id', session()->get('user_id'))
            ->countAllResults() > 0;

SELECT *
FROM `enrolments`
JOIN `students` ON `students`.`student_id` = `enrolments`.`student_id`
JOIN `package` ON `package`.`package_id` = `enrolments`.`package_id`
WHERE `students`.`user_id` = '15'
---
    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $this->setEnrolmentStatus();

        $db = \Config\Database::connect();

        $enrolment = $db->table('enrolments')
            ->join('students', 'students.student_id = enrolments.student_id')
            ->join('package', 'package.package_id = enrolments.package_id')
            ->where('students.user_id', session()->get('user_id'))
            ->get()
            ->getRowArray();

SELECT *
FROM `students`
WHERE `user_id` = '15'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`user_id` = '15'
---
    public function profile()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $this->setEnrolmentStatus();

        $studentModel = new StudentModel();
        $userModel    = new UserModel();

        $student = $studentModel->where('user_id', session()->get('user_id'))->first();
        $user    = $userModel->find(session()->get('user_id'));

SELECT *
FROM `students`
WHERE `user_id` = '15'
 LIMIT 1
INSERT INTO `enrolments` (`student_id`, `package_id`, `payment_method`, `payment_status`) VALUES ('13', '1', 'Credit/Debit Card', 'Paid')
---
    public function processEnrol()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $studentModel = new StudentModel();
        $enrolmentModel = new EnrolmentModel();

        $student = $studentModel->where('user_id', session()->get('user_id'))->first();

        $enrolmentModel->insert([
            'student_id'     => $student['student_id'],
            'package_id'     => $this->request->getPost('package_id'),
            'payment_method' => $this->request->getPost('payment_method'),
            'payment_status' => 'Paid'
        ]);

SELECT *
FROM `enrolments`
JOIN `package` ON `package`.`package_id` = `enrolments`.`package_id`
JOIN `students` ON `students`.`student_id` = `enrolments`.`student_id`
WHERE `students`.`user_id` = '15'
SELECT *
FROM `student_courses`
JOIN `courses` ON `courses`.`course_id` = `student_courses`.`course_id`
JOIN `students` ON `students`.`student_id` = `student_courses`.`student_id`
WHERE `students`.`user_id` = '15'
---
    public function enrolment()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $this->setEnrolmentStatus();

        if (!session()->get('hasEnrolment')) {
            return redirect()->to('/student/enrol');
        }

        $db = \Config\Database::connect();

        $enrolment = $db->table('enrolments')
            ->join('package', 'package.package_id = enrolments.package_id')
            ->join('students', 'students.student_id = enrolments.student_id')
            ->where('students.user_id', session()->get('user_id'))
            ->get()
            ->getRowArray();

        $customCourses = $db->table('student_courses')
            ->join('courses', 'courses.course_id = student_courses.course_id')
            ->join('students', 'students.student_id = student_courses.student_id')
            ->where('students.user_id', session()->get('user_id'))
            ->get()
            ->getResultArray();

SELECT *
FROM `courses`
---
    public function courses()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $this->setEnrolmentStatus();

        if (!session()->get('hasEnrolment')) {
            return redirect()->to('/student/enrol');
        }

        $courseModel = new CourseModel();

        $keyword = $this->request->getGet('q');
        if ($keyword) {
            $courseModel->like('course_name', $keyword);
        }

        // ✅ ALL students see ALL courses
        $courses = $courseModel->findAll();

SELECT *
FROM `students`
WHERE `user_id` = '15'
SELECT *
FROM `enrolments`
JOIN `package` ON `package`.`package_id` = `enrolments`.`package_id`
WHERE `enrolments`.`student_id` = '13'
SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '5'
---
    public function courseDetail($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $student = $db->table('students')
            ->where('user_id', session()->get('user_id'))
            ->get()
            ->getRowArray();

        if (!$student) {
            return redirect()->to('/student/enrol');
        }

        $enrolment = $db->table('enrolments')
            ->join('package', 'package.package_id = enrolments.package_id')
            ->where('enrolments.student_id', $student['student_id'])
            ->get()
            ->getRowArray();

        if (!$enrolment) {
            return redirect()->to('/student/enrol');
        }

        $packageName = strtolower($enrolment['package_name']);

        $courseModel = new CourseModel();
        $course = $courseModel->find($id);

SELECT COUNT(*) AS `numrows`
FROM `student_courses`
WHERE `student_id` = '13'
AND `course_id` = '5'
---
            throw new \CodeIgniter\Exceptions\PageNotFoundException();
        }

        $hasBought = $db->table('student_courses')
            ->where('student_id', $student['student_id'])
            ->where('course_id', $id)
            ->countAllResults() > 0;

SELECT *
FROM `students`
WHERE `user_id` = '15'
SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '5'
---
    public function buyCourse($courseId)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        // get student
        $student = $db->table('students')
            ->where('user_id', session()->get('user_id'))
            ->get()
            ->getRowArray();

        if (!$student) {
            return redirect()->to('/student/enrol');
        }

        // get course
        $courseModel = new \App\Models\CourseModel();
        $course = $courseModel->find($courseId);

SELECT *
FROM `students`
WHERE `user_id` = '15'
SELECT COUNT(*) AS `numrows`
FROM `student_courses`
WHERE `student_id` = '13'
AND `course_id` = '5'
INSERT INTO `student_courses` (`student_id`, `course_id`) VALUES ('13', '5')
---
    public function processBuyCourse($courseId)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $student = $db->table('students')
            ->where('user_id', session()->get('user_id'))
            ->get()
            ->getRowArray();

        if (!$student) {
            return redirect()->to('/student/enrol');
        }

        // prevent duplicate purchase
        $exists = $db->table('student_courses')
            ->where('student_id', $student['student_id'])
            ->where('course_id', $courseId)
            ->countAllResults();

        if ($exists == 0) {
            $db->table('student_courses')->insert([
                'student_id' => $student['student_id'],
                'course_id'  => $courseId
            ]);